In [1]:
import pandas as pd

/Users/umeshregmi/miniconda3/lib/python3.10/site-packages/pandas/core/arrays/masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

### series  ---> 1D array
### dataframe --> 2D array

In [3]:
a = pd.Series([1,2,3,4])

In [4]:
a

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
type(a)

pandas.core.series.Series

In [8]:
my_series = pd.Series([1,2,3,4], index=['a', 'b', 'c', 'd'])

In [9]:
a

a    1
b    2
c    3
d    4
dtype: int64

In [10]:
my_series['a']

1

In [11]:
my_series['a': 'c']

a    1
b    2
c    3
dtype: int64

In [12]:
calories = {"day1": 420, "day2": 380, "day3": 390}

In [13]:
aaa = pd.Series(calories)

In [14]:
aaa

day1    420
day2    380
day3    390
dtype: int64

In [15]:
a = pd.Series([1,2,3,4], index=['a', 'a', 'c', 'd'])

In [16]:
a

a    1
a    2
c    3
d    4
dtype: int64

In [17]:
a + 5

a    6
a    7
c    8
d    9
dtype: int64

In [18]:
first = pd.Series([1,2,3])
second = pd.Series([4,5,6])

In [19]:
first

0    1
1    2
2    3
dtype: int64

In [20]:
second

0    4
1    5
2    6
dtype: int64

In [21]:
first + second

0    5
1    7
2    9
dtype: int64

In [23]:
third = pd.Series([1,2,3,4])
fourth = pd.Series([4,5,6])

In [24]:
third + fourth

0    5.0
1    7.0
2    9.0
3    NaN
dtype: float64

In [25]:
third.index

RangeIndex(start=0, stop=4, step=1)

In [26]:
my = pd.Series([1,2,3,4], index=['a', 'a', 'c', 'd'])

In [27]:
my.index

Index(['a', 'a', 'c', 'd'], dtype='object')

In [28]:
my.values

array([1, 2, 3, 4])

In [29]:
my.dtype

dtype('int64')

In [30]:
my.shape

(4,)

In [31]:
my.size

4

In [32]:
my.ndim

1

In [33]:
my.T

a    1
a    2
c    3
d    4
dtype: int64

In [34]:
my

a    1
a    2
c    3
d    4
dtype: int64

In [35]:
my.hasnans

False

In [36]:
my.empty

False

In [37]:
my.max()

4

In [38]:
my.min()

1

In [39]:
my.std()

1.2909944487358056

In [40]:
my.mean()

2.5

In [41]:
my.median()

2.5

In [42]:
my.var()

1.6666666666666667

In [43]:
my.sum()

10

In [44]:
my_dict = {'names': ['ram', 'shyam', 'hari'], 'age': [20, 30, 40]}

In [47]:
df = pd.DataFrame(my_dict, index=['a', 'b', 'c'])

In [48]:
df

   names  age
a    ram   20
b  shyam   30
c   hari   40

In [49]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [50]:
df.values

array([['ram', 20],
       ['shyam', 30],
       ['hari', 40]], dtype=object)

In [51]:
df.dtypes

names    object
age       int64
dtype: object

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   3 non-null      object
 1   age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 72.0+ bytes

In [53]:
df.ndim

2

In [54]:
df.size

6

In [55]:
df.shape

(3, 2)

In [56]:
df.empty

False

In [58]:
df = pd.read_csv('titanic.csv')

In [59]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [60]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [61]:
len(df.columns)

12

In [62]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [65]:
df.Survived

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [66]:
df['Survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [67]:
df[['Survived', 'Sex', 'Age']]

     Survived     Sex   Age
0           0    male  22.0
1           1  female  38.0
2           1  female  26.0
3           1  female  35.0
4           0    male  35.0
..        ...     ...   ...
886         0    male  27.0
887         1  female  19.0
888         0  female   NaN
889         1    male  26.0
890         0    male  32.0

[891 rows x 3 columns]

In [69]:
df.Age.mean()

29.69911764705882

In [70]:
df.Age.min()

0.42

In [71]:
df.Age.max()

80.0

In [72]:
df.Age.std()

14.526497332334042

In [73]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [74]:
df.head(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [75]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [76]:
df.tail(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.125,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.450,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.750,NaN,Q

In [78]:
df.Embarked.value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [79]:
df.Sex.value_counts()

Sex
male      577
female    314
Name: count, dtype: int64